### DHCP Configuration on Cisco Router

#### ðŸ”¸ What is DHCP?
> DHCP (Dynamic Host Configuration Protocol) automatically assigns:
- IP Address  
- Subnet Mask  
- Default Gateway  
- DNS Server  

> to client devices (PCs, laptops, phones).

---

> Network Example
- **Network:** 192.168.1.0/24  
- **Gateway:** 192.168.1.1  
- **DNS:** 8.8.8.8  

---

### STEP 1: CONFIGUR IP ON ROUTER INTERFACE
```py
Router> enable
Router# configure terminal

Router(config)# interface g0/0
Router(config-if)# ip address 192.168.1.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit

# âœ… This IP will act as the Default Gateway
```

### STEP 2: Exclude IP Addresses (Important)
```py
# Used for router, server, or static IPs.

Router(config)# ip dhcp excluded-address 192.168.1.1 192.168.1.10

# NOET : Resrver 192.168.1.1 TO 9 Ips
# âž¡ï¸ DHCP will NOT assign these IPs

# Create DHCP Pool
Router(config)# ip dhcp pool LAN_POOL

# Define Network Range
Router(dhcp-config)# network 192.168.1.0 255.255.255.0

```
Skip to content
Chat history



You said:
howt to configur edhcp in router configure command 
ChatGPT said:
Below is a simple, CCNA-friendly step-by-step guide to configure DHCP on a Cisco Router using CLI commands ðŸ‘‡
(Explained in easy language, useful for labs + interviews)

ðŸ”¹ DHCP Configuration on Cisco Router
ðŸ”¸ What is DHCP?
DHCP (Dynamic Host Configuration Protocol) automatically gives:

IP Address

Subnet Mask

Default Gateway

DNS Server

to client devices (PCs, laptops, phones).

ðŸ”¹ Network Example
Network: 192.168.1.0/24
Gateway: 192.168.1.1
DNS: 8.8.8.8
ðŸ”¹ Step 1: Configure IP on Router Interface
Router> enable
Router# configure terminal

Router(config)# interface g0/0
Router(config-if)# ip address 192.168.1.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit
âœ… This IP will act as Default Gateway

ðŸ”¹ Step 2: Exclude IP Addresses (Important)
Used for router, server, or static IPs.

Router(config)# ip dhcp excluded-address 192.168.1.1 192.168.1.10
âž¡ï¸ DHCP will NOT assign these IPs

ðŸ”¹ Step 3: Create DHCP Pool
Router(config)# ip dhcp pool LAN_POOL
ðŸ”¹ Step 4: Define Network Range
Router(dhcp-config)# network 192.168.1.0 255.255.255.0
ðŸ”¹ Step 5: Configure Default Gateway
Router(dhcp-config)# default-router 192.168.1.1
ðŸ”¹ Step 6: Configure DNS Server
Router(dhcp-config)# dns-server 8.8.8.8
ðŸ”¹ Step 7: (Optional) Set Domain Name
Router(dhcp-config)# domain-name docxinfo.local
ðŸ”¹ Step 8: Exit Configuration
Router(dhcp-config)# exit
Router(config)# exit
âœ… DHCP Configuration DONE ðŸŽ‰
ðŸ”¹ Verify DHCP Configuration
ðŸ” Check DHCP Pool
Router# show ip dhcp pool
ðŸ” Check Assigned IPs
Router# show ip dhcp binding
ðŸ” Check DHCP Configuration
Router# show running-config | section dhcp
ðŸ”¹ Client Side (PC)
Set IP Configuration â†’ DHCP / Automatic
Then test:

ping 192.168.1.1
ðŸ”¹ Common Interview Questions (Quick)
Why exclude IP addresses?
âž To reserve IPs for router/servers

Can router act as DHCP server?
âž Yes

DHCP uses which ports?
âž UDP 67 (Server) & 68 (Client)

If you want:
âœ… DHCP Relay configuration
âœ… Multiple DHCP pools
âœ… Packet Tracer lab diagram
âœ… README.md format for GitHub

Just tell me ðŸ‘

You said:
give me command readem.md fomat ðŸ”¹ DHCP Configuration on Cisco Router
ðŸ”¸ What is DHCP?

DHCP (Dynamic Host Configuration Protocol) automatically gives:

IP Address

Subnet Mask

Default Gateway

DNS Server

to client devices (PCs, laptops, phones).

ðŸ”¹ Network Example
Network: 192.168.1.0/24
Gateway: 192.168.1.1
DNS: 8.8.8.8

ðŸ”¹ Step 1: Configure IP on Router Interface
Router> enable
Router# configure terminal

Router(config)# interface g0/0
Router(config-if)# ip address 192.168.1.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit


âœ… This IP will act as Default Gateway

ðŸ”¹ Step 2: Exclude IP Addresses (Important)

Used for router, server, or static IPs.

Router(config)# ip dhcp excluded-address 192.168.1.1 192.168.1.10


âž¡ï¸ DHCP will NOT assign these IPs

ðŸ”¹ Step 3: Create DHCP Pool
Router(config)# ip dhcp pool LAN_POOL

ðŸ”¹ Step 4: Define Network Range
Router(dhcp-config)# network 192.168.1.0 255.255.255.0

ðŸ”¹ Step 5: Configure Default Gateway
Router(dhcp-config)# default-router 192.168.1.1

ðŸ”¹ Step 6: Configure DNS Server
Router(dhcp-config)# dns-server 8.8.8.8

ðŸ”¹ Step 7: (Optional) Set Domain Name
Router(dhcp-config)# domain-name docxinfo.local

ðŸ”¹ Step 8: Exit Configuration
Router(dhcp-config)# exit
Router(config)# exit

âœ… DHCP Configuration DONE ðŸŽ‰
ðŸ”¹ Verify DHCP Configuration
ðŸ” Check DHCP Pool
Router# show ip dhcp pool

ðŸ” Check Assigned IPs
Router# show ip dhcp binding

ðŸ” Check DHCP Configuration
Router# show running-config | section dhcp

ðŸ”¹ Client Side (PC)

Set IP Configuration â†’ DHCP / Automatic
Then test:

ping 192.168.1.1

ðŸ”¹ Common Interview Questions (Quick)

Why exclude IP addresses?
âž To reserve IPs for router/servers

Can router act as DHCP server?
âž Yes

DHCP uses which ports?
âž UDP 67 (Server) & 68 (Client)
ChatGPT said:
# ðŸ”¹ DHCP Configuration on Cisco Router

## ðŸ”¸ What is DHCP?
**DHCP (Dynamic Host Configuration Protocol)** automatically assigns:
- IP Address  
- Subnet Mask  
- Default Gateway  
- DNS Server  

to client devices (PCs, laptops, phones).

---

## ðŸ”¹ Network Example
- **Network:** 192.168.1.0/24  
- **Gateway:** 192.168.1.1  
- **DNS:** 8.8.8.8  

---

> Configure IP on Router Interface
```bash
Router> enable
Router# configure terminal

Router(config)# interface g0/0
Router(config-if)# ip address 192.168.1.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit
# âœ… This IP will act as the Default Gateway

# Exclude IP Addresses (Important)
# Used for router, server, or static IPs.

Router(config)# ip dhcp excluded-address 192.168.1.1 192.168.1.10
# DHCP will NOT assign these IPs

# Create DHCP Pool
Router(config)# ip dhcp pool LAN_POOL

# Define Network Range
Router(dhcp-config)# network 192.168.1.0 255.255.255.0

# Configure Default Gateway
Router(dhcp-config)# default-router 192.168.1.1 

# Configure DNS Server
Router(dhcp-config)# dns-server 8.8.8.8

# (Optional) Set Domain Name
Router(dhcp-config)# domain-name docxinfo.local

# Exit Configuration
Router(dhcp-config)# exit
Router(config)# exit
```
> âœ… DHCP Configuration DONE ðŸŽ‰
```py
# Verify DHCP Configuration
# ðŸ” Check DHCP Pool

Router# show ip dhcp pool

# ðŸ” Check Assigned IPs
Router# show ip dhcp binding

#ðŸ” Check DHCP Configuration
Router# show running-config | section dhcp

# Client Side (PC)
#Set IP Configuration â†’ DHCP / Automatic
```
> Test connectivity: `ping 192.168.1.1`

